In [3]:
!pip install faker

Collecting faker
  Downloading https://files.pythonhosted.org/packages/f5/7e/41e4efbec4722a6b0fe44acffed08b9477b9334c3e40a7a877291a20e7fe/Faker-1.0.4-py2.py3-none-any.whl (846kB)
    100% |████████████████████████████████| 849kB 4.6MB/s eta 0:00:01
Requirement already satisfied: six>=1.10 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from faker) (1.11.0)
Requirement already satisfied: python-dateutil>=2.4 in /home/nbuser/anaconda3_501/lib/python3.6/site-packages (from faker) (2.7.5)
Collecting text-unidecode==1.2 (from faker)
  Downloading https://files.pythonhosted.org/packages/79/42/d717cc2b4520fb09e45b344b1b0b4e81aa672001dd128c180fabc655c341/text_unidecode-1.2-py2.py3-none-any.whl (77kB)
    100% |████████████████████████████████| 81kB 9.2MB/s eta 0:00:01
Installing collected packages: text-unidecode, faker
Successfully installed faker-1.0.4 text-unidecode-1.2

In [4]:

import faker
fake = faker.Faker()
fake.name()

'William Hale'

In [5]:
import pandas as pd

In [28]:
raw_data = {'ID':[812001,812002,812003,812004,812005,812006],'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy','Juan'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze','Perez'], 
        'age': [42, 52, 36, 24, 73,13], 
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston','San Francisco']}

df = pd.DataFrame(raw_data, columns = ['ID','first_name', 'last_name', 'age', 'city'])
df

       ID first_name last_name  age           city
0  812001      Jason    Miller   42  San Francisco
1  812002      Molly  Jacobson   52      Baltimore
2  812003       Tina       Ali   36          Miami
3  812004       Jake    Milner   24        Douglas
4  812005        Amy     Cooze   73         Boston
5  812006       Juan     Perez   13  San Francisco

In [13]:
city_to_state = { 'San Francisco' : 'California', 
                  'Baltimore' : 'Maryland', 
                  'Miami' : 'Florida', 
                  'Douglas' : 'Arizona', 
                  'Boston' : 'Massachusetts'}

city_to_state2 = { 'San Francisco' : 'CA', 
                  'Baltimore' : 'MLD', 
                  'Miami' : 'FL', 
                  'Douglas' : 'AR', 
                  'Boston' : 'MT'}

       ID first_name last_name  age           city
0  812001      Jason    Miller   42  San Francisco
1  812002      Molly  Jacobson   52      Baltimore
2  812003       Tina       Ali   36          Miami
3  812004       Jake    Milner   24        Douglas
4  812005        Amy     Cooze   73         Boston
5  812006       Juan     Perez   13  San Francisco

In [14]:
df['state'] = df['city'].map(city_to_state)
df

       ID first_name last_name  age           city          state
0  812001      Jason    Miller   42  San Francisco     California
1  812002      Molly  Jacobson   52      Baltimore       Maryland
2  812003       Tina       Ali   36          Miami        Florida
3  812004       Jake    Milner   24        Douglas        Arizona
4  812005        Amy     Cooze   73         Boston  Massachusetts
5  812006       Juan     Perez   13  San Francisco     California

In [15]:
def c2s(city, city_to_state): return city_to_state[city] +" "+ city_to_state2[city]

df['state']= df['city'].apply(lambda x: c2s(x,city_to_state))
df

       ID first_name last_name  age           city             state
0  812001      Jason    Miller   42  San Francisco     California CA
1  812002      Molly  Jacobson   52      Baltimore      Maryland MLD
2  812003       Tina       Ali   36          Miami        Florida FL
3  812004       Jake    Milner   24        Douglas        Arizona AR
4  812005        Amy     Cooze   73         Boston  Massachusetts MT
5  812006       Juan     Perez   13  San Francisco     California CA

In [26]:
df

,level_0,index,New_ID,ID,first_name,last_name,age,city,state
0,0,0,880,812001,Jason,Miller,42,San Francisco,California CA
1,1,1,881,812002,Molly,Jacobson,52,Baltimore,Maryland MLD
2,2,2,882,812003,Tina,Ali,36,Miami,Florida FL
3,3,3,883,812004,Jake,Milner,24,Douglas,Arizona AR
4,4,4,884,812005,Amy,Cooze,73,Boston,Massachusetts MT
5,5,5,885,812006,Juan,Perez,13,San Francisco,California CA

In [36]:
try:
    df.drop("New_ID",axis=1, inplace=True)
except:
    print('Column New_ID doesnt exist')
    
df.insert(0, 'New_ID', range(100, 100 + len(df)))
df

   New_ID      ID first_name last_name  age           city
0     100  812001      Jason    Miller   42  San Francisco
1     101  812002      Molly  Jacobson   52      Baltimore
2     102  812003       Tina       Ali   36          Miami
3     103  812004       Jake    Milner   24        Douglas
4     104  812005        Amy     Cooze   73         Boston
5     105  812006       Juan     Perez   13  San Francisco